In [130]:
import pandas as pd

In [131]:
df = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['A', 'B', 'C', 'D'],
    'age': [10, 20, 25, 30]
})

In [132]:
df

   age  id name
0   10   1    A
1   20   2    B
2   25   3    C
3   30   4    D

In [133]:
df['salary'] = df['age'].apply(lambda age_val: 20000 if (age_val > 10 and age_val < 30) else None)

In [134]:
df

   age  id name   salary
0   10   1    A      NaN
1   20   2    B  20000.0
2   25   3    C  20000.0
3   30   4    D      NaN

In [135]:
df['salary'] = df['salary'].apply(lambda sal_val: sal_val + 5000 if pd.notnull(sal_val) else 5000)

In [136]:
df

   age  id name   salary
0   10   1    A   5000.0
1   20   2    B  25000.0
2   25   3    C  25000.0
3   30   4    D   5000.0